a = input('Собака короткошерстной породы? ')
if a == 'да':
    b = input('Рост собаки менее 50 см? ')
    if b == 'да':
        c = input('У собаки короткий хвост? ')
        if c == 'да':
            print('английский бульдог')
        else:
            d = input('У собаки длинные уши? ')
            if d == 'да':
                print('гончая')
            else:
                e = input('У собаки короткое тело? ')
                if e == 'да':
                    print('мопс')
                else:
                    print('чихуахуа')
    else:
        f = input('Собака весит более 50 кг? ')
        if f == 'да':
            print('датский дог')
        else:
            print('фоксхаунд')
else:
    g = input('Рост собаки менее 50 см? ')
    if g == 'да':
        h = input('У собаки доброжелательный характер? ')
        if h == 'да':
            print('кокер-спаниель')
        else:
            print('ирландский сеттер')
    else:
        i = input('У собаки рост менее 70 см? ')
        if i == 'да':
            j = input('У собаки длинные уши? ')
            if j == 'да':
                print('большой вандейский грифон')
            else:
                k = input('Окрас рыжий с белыми отметинами? ')
                if k == 'да':
                    print('колли')
                else:
                    print('сенбернар')
        else:
            l = input('Белоснежный окрас? ')
            if l == 'да':
                print('ирландский волкодав')
            else:
                print('ньюфаундленд')